[["# NumPy", "NumPy\n\nNumPy (or Numpy) is a Linear Algebra Library for Python, the reason it is so important for Data Science with Python is that almost all of the libraries in the PyData Ecosystem rely on NumPy as one of their main building blocks.\n\nNumpy is also incredibly fast, as it has bindings to C libraries. For more info on why you would want to use Arrays instead of lists, check out this great [StackOverflow post](http://stackoverflow.com/questions/993984/why-numpy-instead-of-python-lists).\n\nWe will only learn the basics of NumPy, to get started we need to install it!"], ["## Installation Instructions", "Installation Instructions\n\n**It is highly recommended you install Python using the Anaconda distribution to make sure all underlying dependencies (such as Linear Algebra libraries) all sync up with the use of a conda install. If you have Anaconda, install NumPy by going to your terminal or command prompt and typing:**\n    \n    conda install numpy\n    \n**If you do not have Anaconda and can not install it, please refer to [Numpy's official documentation on various installation instructions.](http://docs.scipy.org/doc/numpy-1.10.1/user/install.html)**"], ["## Using NumPy", "Using NumPy\n\nOnce you've installed NumPy you can import it as a library:\nimport numpy as np\nNumpy has many built-in functions and capabilities. We won't cover them all but instead we will focus on some of the most important aspects of Numpy: vectors,arrays,matrices, and number generation. Let's start by discussing arrays.\n"], ["# Numpy Arrays", "Numpy Arrays\n\nNumPy arrays are the main way we will use Numpy throughout the course. Numpy arrays essentially come in two flavors: vectors and matrices. Vectors are strictly 1-d arrays and matrices are 2-d (but you should note a matrix can still have only one row or one column).\n\nLet's begin our introduction by exploring how to create NumPy arrays.\n"], ["## Creating NumPy Arrays", "Creating NumPy Arrays\n\n### From a Python List\n\nWe can create an array by directly converting a list or list of lists:\nmy_list = [1,2,3]\nmy_list\nnp.array(my_list)\nmy_matrix = [[1,2,3],[4,5,6],[7,8,9]]\nmy_matrix\nnp.array(my_matrix)"], ["## Built-in Methods", "Built-in Methods\n\nThere are lots of built-in ways to generate Arrays\n### arange\n\nReturn evenly spaced values within a given interval.\nnp.arange(0,10) #start is first number and amount is second\nnp.arange(0,11,2) #start is first number and amount is second and step size is third\n### zeros and ones\n\nGenerate arrays of zeros or ones\nnp.zeros(3)\nnp.zeros((5,5))\nnp.ones(3)\nnp.ones((3,3))\n### linspace\nReturn evenly spaced numbers over a specified interval.\nnp.linspace(0,10,3)\nnp.linspace(0,10,50)"], ["## eye", "eye\n\nCreates an identity matrix\nnp.eye(4)"], ["## Random", "Random\n\nNumpy also has lots of ways to create random number arrays:\n\n### rand\nCreate an array of the given shape and populate it with\nrandom samples from a uniform distribution\nover ``[0, 1)``.\nnp.random.rand(2)\nnp.random.rand(5,5)\n### randn\n\nReturn a sample (or samples) from the \"standard normal\" distribution. Unlike rand which is uniform:\nnp.random.randn(2)\nnp.random.randn(5,5)\n### randint\nReturn random integers from `low` (inclusive) to `high` (exclusive).\nnp.random.randint(1,100)\nnp.random.randint(1,100,10)"], ["## Array Attributes and Methods", "Array Attributes and Methods\n\nLet's discuss some useful attributes and methods or an array:\narr = np.arange(25)\nranarr = np.random.randint(0,50,10)\narr\nranarr"], ["## Reshape", "Reshape\nReturns an array containing the same data with a new shape.\narr.reshape(5,5)\n### max,min,argmax,argmin\n\nThese are useful methods for finding max or min values. Or to find their index locations using argmin or argmax\nranarr\nranarr.max()\nranarr.argmax()\nranarr.min()\nranarr.argmin()"], ["## Shape", "Shape\n\nShape is an attribute that arrays have (not a method):\n# Vector\narr.shape\n# Notice the two sets of brackets\narr.reshape(1,25)\narr.reshape(1,25).shape\narr.reshape(25,1)\narr.reshape(25,1).shape\n### dtype\n\nYou can also grab the data type of the object in the array:\narr.dtype"], ["# Great Job!", "Great Job!"]]